LIMITS_OF_JOINTS_UKT = {
    0: (-12.0, 4.0),   # L_ShoulderF        [4.0, -12] + назад совпадают
    1: (0.0, 12.0),    # L_ShoulderS    [0, 12] + вверх от тела совпадают
    2: (-9.0, 9.0),    # L_ElbowR        [-9.0, 9.0] + против часовой совпадают
    3: (-12.0, 0.0),   # L_Elbow                 [0, -12] + вниз совпадают
    4: (-11.0, 11.0),  # L_WristR
    5: (-2.0, 7.0),    # L_WristS
    6: (-2.5, 3.0),    # L_WristF
    7: (-11.0, 0.0),   # L_Finger_Index       [0, -11] -согнут +разогнут
    9: (-11.0, 0.0),   # L_Finger_Middle      [0, -11]
    8: (-11.0, 0.0),   # L_Finger_Little      [0, -11]
    10: (-11.0, 0.0),  # L_Finger_Ring       [0, -11]
    11: (-3.0, 9.0),   # L_Finger_ThumbS     [-3, 9] -сжать, +разжать поворот
    12: (11.0, 0.0),   # L_Finger_Thumb       [0, 11] сгибание
    13: (-12.0, 4.0),  # R_ShoulderF      [4.0, -12] + назад совпадают
    14: (-12.0, 0.0),  # R_ShoulderS        [0, -12] + вниз к телу совпадают
    15: (-9.0, 9.0),   # R_ElbowR            [-9.0, 9.0] + против часовой совпадают
    16: (-12.0, 0.0),  # R_Elbow            [0, -12]    + вниз совпадают
    17: (-11.0, 11.0), # R_WristR
    18: (-2.0, 7.0),   # R_WristS
    19: (-2.5, 3.0),   # R_WristF
    20: (11.0, 0.0),   # R_Finger_Index      [0, 11] +согнут 0 разогнут
    21: (11.0, 0.0),   # R_Finger_Little     [0, 11] [0.595, 11]
    22: (11.0, 0.0),   # R_Finger_Middle     [0, 11] [0.0749, 11]
    23: (11.0, 0.0),   # R_Finger_Ring       [0, 11]
    24: (3.0, -9.0),   # R_Finger_ThumbS     [-9, 3] [-9, 1.173] +сжать -разжать
    25: (-11.0, 0.0),  # R_Finger_Thumb       [0, 11] [-0.034, 11]
}